-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 
-- 伺服器版本： 10.4.8-MariaDB
-- PHP 版本： 7.2.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `constellation`
--

-- --------------------------------------------------------

--
-- 資料表結構 `constellation`
--

CREATE TABLE `constellation` (
  `id` int(10) UNSIGNED NOT NULL,
  `date` date NOT NULL,
  `constellation` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `overall_star` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `overall_description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `love_star` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `love_description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `career_star` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `career_description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `money_star` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `money_description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `constellation`
--

INSERT INTO `constellation` (`id`, `date`, `constellation`, `overall_star`, `overall_description`, `love_star`, `love_description`, `career_star`, `career_description`, `money_star`, `money_description`, `created_at`, `updated_at`) VALUES
(75, '2020-03-29', '雙魚座', '★★★☆☆', '今天錯怪了朋友，多源於自己的疑心病過重，用最有誠意的方式向朋友道歉吧；去書店，點杯咖啡，聽著悠揚的音樂，看一本好書，可望將壞心情通通扔掉；今天的財運不錯哦，股票大漲一波讓你賺得個荷包滿滿，但是不能太貪心，還是見好就收哦。', '★★★☆☆', '已婚者對愛情的需求度較低，與其和另一半待在一起無話可說，不如和好朋友熱鬧開懷。', '★★☆☆☆', '長輩對你有諸多要求，感覺有很多雙眼睛都在盯著你，要特別注意自己的言行舉止。', '★★★★☆', '管理錢財有一套，適合替人管帳、理財。', '2020-03-29 04:00:13', '2020-03-29 04:00:13'),
(76, '2020-03-29', '金牛座', '★★★★☆', '今天投資獲利的機會高，可四處跑跑廣開財路，長期投資的前景比較不錯；以前的默默耕耘、日積月累在今天有較高機會得到最佳的釋放時機；情緒較高亢的你找幾個朋友去酒吧或KTV釋放一些精力吧。', '★★★★☆', '戀愛中人愛情進展相對平順，容易因錢而起衝突，要有一方肯妥協才能避免爭吵！', '★★★★☆', '顯得非常自信，覺得自己有足夠的實力去完成頭腦中的計劃，運勢很旺，加油！', '★★★★☆', '容易有意外驚喜，但不宜過度投機。', '2020-03-29 04:00:14', '2020-03-29 04:00:14'),
(77, '2020-03-29', '雙子座', '★★★☆☆', '選擇電話與對方聯繫，你們的溝通會更加順暢；學生族在與家人互動的過程中會有人提及你弱勢的功課，讓你陷入尷尬處境；財運平順，娛樂懂得節制，並無大的支出。', '★★☆☆☆', '夫妻感情不太穩定，容易發生爭吵事件，別表現出強勢，彼此多包容。', '★★★☆☆', '對周圍人的要求嚴苛，稍有不滿就容易發脾氣，批評他人，對你的人際關係很不利唷！', '★★★☆☆', '有借有還，再借不一定有還，錢借出之前想清後果。', '2020-03-29 04:00:15', '2020-03-29 04:00:15'),
(78, '2020-03-29', '巨蟹座', '★★★☆☆', '今天單身者渴望戀愛，但太過內斂、被動，容易錯過良緣。財運上，需要瞭解的資訊很多，雖然較有耐心，但效率不高，留意身邊的貴人，他人相助會讓你更順利。今天應少量多餐，讓營養充分吸收。', '★★★☆☆', '渴望得到異性朋友的關懷，對關心你的異性很有好感。不過，別把這種情感與愛情混淆喔！', '★★★☆☆', '在室內坐得太久，偶爾也要起身活動活動，看看窗外的景色，更有利於處理事務。', '★★★★☆', '在投資上會得到初步回報，如果把眼光放遠，把網撒大一些，能進財更多。', '2020-03-29 04:00:15', '2020-03-29 04:00:15'),
(79, '2020-03-29', '獅子座', '★★★☆☆', '今天的面子觀很強，不肯在對方面前承認自己犯下的錯誤，小心因此與戀人進入冷戰；理解能力增強，他人傳授的知識能夠很快的收為己用；財運頗旺，收集的信息大為合用，投資收益不錯。', '★☆☆☆☆', '今日的你處理疑難雜症的能力比較差，遇到爭執時不要急著解釋，先認錯息事比較要緊。', '★★★☆☆', '由於受到矛盾心理的煎熬而讓手中的事有停滯不前的現象，適時調整好情緒才好。', '★★★★★', '財運暢通無阻，想要周轉金錢、討債的人，趕快利用今天的吉運吧，只要勇於開口，大多能心想事成！', '2020-03-29 04:00:16', '2020-03-29 04:00:16'),
(80, '2020-03-29', '處女座', '★★★★☆', '戀情沒新進展，有點苦悶和不安，順其自然吧，感情勉強得不來；工作中表現出超強應變能力，能得到同事欣賞，如更注重團結協作，定能為事業發展添磚加瓦；資金周轉上易出現困難，但能得到朋友所送之炭，燃眉之急可解。', '★★★☆☆', '有機會接觸到條件不錯的對象，別太木訥，主動追求才有進一步認識的可能！', '★★★★☆', '幹勁十足，對自我要求甚高，希望有好的表現，也容易達成所願，不過千萬別驕傲唷！', '★★★★☆', '財運暢通無阻，有利於金錢運作。有大量資金流通的現象，對於有錢人的影響較大，適合錢滾錢的一天。', '2020-03-29 04:00:16', '2020-03-29 04:00:16'),
(81, '2020-03-29', '天秤座', '★★★☆☆', '交友宜慎重，特別是異性朋友，否則很容易受其蒙騙而傷害到自己；今天有機會在他人面前炫耀你的理財知識，他人的讚許頗讓你得意；對於工作有些厭倦，不如讓自己好好放個假，享受假日的清閒。', '★★☆☆☆', '多看到另一半的優點，別吝嗇誇獎對方，多用欣賞的眼光看待另一半，你會被愛包圍喔！', '★★☆☆☆', '喜好與厭惡相當分明，對喜歡的人熱絡得很，而對不喜歡的人不是反應冷淡就是冷嘲熱諷。', '★★★☆☆', '財神在你身邊忽隱忽現，有很多賺錢的機會都是一閃而過。', '2020-03-29 04:00:17', '2020-03-29 04:00:17'),
(82, '2020-03-29', '天蠍座', '★★★☆☆', '看著伴侶臉上洋溢著幸福，你會覺得為他付出再多也值得；今天的財運可沒來得及眷顧你，與親戚朋友聚會時可別上牌桌哦，不然有漏財的危險；有時間多陪陪父母，讓他們享享天倫之樂。', '★★★★☆', '多與另一半分享你的心情，不管是快樂還是憂傷，和對方說說可增進彼此的感情喔。', '★★★☆☆', '合理安排時間是關鍵。很多事情擺在眼前，應分清事情的輕重緩急，有條理地進行！', '★★☆☆☆', '千萬不可因求財心切，而沒有進行分析策劃就盲目投資，造成錢財損失。', '2020-03-29 04:00:17', '2020-03-29 04:00:17'),
(83, '2020-03-29', '射手座', '★★★★★', '今天桃花運不錯，單身者有機會與心儀的對象單獨相處，直截了當的表露心聲會有意想不到的好效果。今天狀態良好，能自如的應對各種事務，拿出令人滿意的成績。', '★★★★☆', '臉上多些自然的微笑，就會特別吸引人，異性也會主動與你親近，戀愛指數也將不斷提升！', '★★★★☆', '有機會在眾人面前表現自己的才華，例如：演講、跳舞、朗誦等，應抓住機會。', '★★★★★', '財運不錯，如果有不錯的進財機會，可以相信你的直覺。', '2020-03-29 04:00:18', '2020-03-29 04:00:18'),
(84, '2020-03-29', '魔羯座', '★★★★☆', '思考力不足，若過度用腦會讓你分不清方向，今天好好休息比較妥當。閒來無事可以收拾收拾房間，乾淨、舒適的環境可為你帶來好心情。下午有機會與異性朋友喝下午茶或是閒聊、逛公園等，感覺愜意。', '★★★★☆', '已婚者能獲得另一半的支持與鼓勵，內心有著滿滿的幸福感；單身者容易陷入多角戀。', '★★★☆☆', '悠閒愜意的一天，有機會與朋友相聚，在喝茶、享受美食中獲得滿足感。', '★★★★☆', '財運好到讓人羨慕眼紅，適合投資理財的好日子，股票族有機會撈一筆哦！千萬別錯過今日的大好財運喔！', '2020-03-29 04:00:18', '2020-03-29 04:00:18'),
(85, '2020-03-29', '水瓶座', '★★★☆☆', '與情人在一起開車時更要注意集中精力，神經興奮過度易發生意外。今天比較健忘，家人交待要購買的東西，最好做一份備忘錄。傍晚運勢上升，參加聚會單身者有機會結識不少新的異性朋友。', '★★★★☆', '單身者容易遇到自己的夢中情人，但有「愛在心頭口難開」的窘境。別緊張，大膽表白吧。', '★★☆☆☆', '事業運不太好，處事別太莽撞，小心白忙一場；與人交往應謹言慎行。', '★★★☆☆', '財運普通，急功近利之心不可有。', '2020-03-29 04:00:19', '2020-03-29 04:00:19'),
(86, '2020-03-29', '牡羊座', '★★★★★', '平時花足功夫的人際關係今天發揮作用，各部門的鼎立合作與配合使你的工作開展的比預期還要順利；感情事故也因朋友的介入和勸說而得到修復；投資理財應在規避風險上花點時間和精力研究，必要時可求助金融領域的朋友。', '★★★★☆', '已婚者易得到另一半的重視，有什麼要求都可以提出來；單身者容易有意想不到的桃花！', '★★★★★', '有機會幫同事調解紛爭，也因此能獲得同事的信賴呢！', '★★★★☆', '滿腦子都想著錢，有錢才有安全感的一天。也因為對錢的敏銳度較強，所以適合積極經營財富。', '2020-03-29 04:00:20', '2020-03-29 04:00:20');

-- --------------------------------------------------------

--
-- 資料表結構 `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `constellation`
--
ALTER TABLE `constellation`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `constellation`
--
ALTER TABLE `constellation`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=87;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
